app/Controllers/DokterController.php

    public function edit($id)
    {
        $data = [
            'title' => 'Edit Dokter',
            'breadcrumb' => ['Dokter', 'Edit Dokter'],
            'dokter' => $this->dokterModel->find($id),
---
SELECT *
FROM `dokter`
WHERE `dokter`.`id` = '1'