app/Controllers/DokterController.php

    public function create()
    {
        $data = [
            'breadcrumb' => ['Dokter', 'Tambah Dokter'],
            'breadcrumbLinks' => ['/dokter', '/dokter/create'],
            'title' => 'Tambah Dokter',
            'poli' => $this->poliModel->findAll(),
        ];
---
SELECT *
FROM `poli`

    public function store()
    {
        $this->validate([
            'nama' => 'required',
            'alamat' => 'required',
            'no_hp' => 'required',
            'id_poli' => 'required',
        ]);

        $this->dokterModel->save([
            'nama' => $this->request->getPost('nama'),
            'alamat' => $this->request->getPost('alamat'),
            'no_hp' => $this->request->getPost('no_hp'),
            'id_poli' => $this->request->getPost('id_poli'),
        ]);
---
UPDATE `dokter` SET `nama` = 'Dr. Andi Rahmat', `alamat` = 'Jl. Merdeka No. 10, Jakarta', `no_hp` = '081234567890', `id_poli` = '1'
WHERE `dokter`.`id` IN ('1')

    public function daftarPasien()
    {
        $idDokter = session()->get('userId'); // Ambil ID dokter dari sesi

        $daftarPasien = $this->daftarPoliModel
            ->select('
                daftar_poli.id,
                pasien.nama AS nama_pasien,
                poli.nama_poli,
                daftar_poli.keluhan,
                periksa.id AS id_periksa,
                periksa.tanggal_periksa
            ')
            ->join('pasien', 'pasien.id = daftar_poli.id_pasien', 'left')
            ->join('poli', 'poli.id = daftar_poli.id_poli', 'left')
            ->join('jadwal_periksa', 'jadwal_periksa.id = daftar_poli.id_jadwal', 'left')
            ->join('periksa', 'periksa.id_daftar_poli = daftar_poli.id', 'left') // Join ke tabel periksa
            ->where('jadwal_periksa.id_dokter', $idDokter)
            ->findAll();
---
SELECT `daftar_poli`.`id`, `pasien`.`nama` AS `nama_pasien`, `poli`.`nama_poli`, `daftar_poli`.`keluhan`, `periksa`.`id` AS `id_periksa`, `periksa`.`tanggal_periksa`
FROM `daftar_poli`
LEFT JOIN `pasien` ON `pasien`.`id` = `daftar_poli`.`id_pasien`
LEFT JOIN `poli` ON `poli`.`id` = `daftar_poli`.`id_poli`
LEFT JOIN `jadwal_periksa` ON `jadwal_periksa`.`id` = `daftar_poli`.`id_jadwal`
LEFT JOIN `periksa` ON `periksa`.`id_daftar_poli` = `daftar_poli`.`id`
WHERE `jadwal_periksa`.`id_dokter` = '1'

    public function detailPasien($id)
    {
        $pasien = $this->daftarPoliModel
            ->select('daftar_poli.*, pasien.nama AS nama_pasien, poli.nama_poli')
            ->join('pasien', 'pasien.id = daftar_poli.id_pasien', 'left')
            ->join('poli', 'poli.id = daftar_poli.id_poli', 'left')
            ->where('daftar_poli.id', $id)
            ->first();

        if (!$pasien) {
            return redirect()->to('/dokter/periksa')->with('error', 'Data pasien tidak ditemukan.');
        }

        $obat = $this->obatModel->findAll();
---
SELECT *
FROM `obat`

    public function storePeriksa()
    {
        $idDaftarPoli = $this->request->getPost('id_daftar_poli');
        $catatan = $this->request->getPost('catatan');
        $biayaPeriksa = 150000; // Biaya periksa standar
        $obatIds = $this->request->getPost('obat') ?? []; // Array ID obat

        // Validasi input
        if (empty($catatan)) {
            return redirect()->back()->withInput()->with('error', 'Catatan pemeriksaan wajib diisi.');
        }

        // Hitung total harga obat
        $totalHargaObat = 0;
        if (!empty($obatIds)) {
            $obat = $this->obatModel->whereIn('id', $obatIds)->findAll();
            foreach ($obat as $item) {
                $totalHargaObat += $item['harga'];
            }
        }

        // Total biaya = biaya periksa + total harga obat
        $totalBiaya = $biayaPeriksa + $totalHargaObat;

        try {
            // Simpan data pemeriksaan
            $idPeriksa = $this->periksaModel->insert([
                'id_daftar_poli' => $idDaftarPoli,
                'tanggal_periksa' => date('Y-m-d'),
                'catatan' => $catatan,
                'biaya_periksa' => $totalBiaya,
            ], true); // True untuk mengembalikan ID yang baru disimpan

            // Simpan data ke tabel detail_periksa
            foreach ($obatIds as $obatId) {
                $this->detailPeriksaModel->insert([
                    'id_periksa' => $idPeriksa,
                    'id_obat' => $obatId,
                ]);
---
SELECT *
FROM `obat`
WHERE `id` IN ('3','8','9','10','11')
INSERT INTO `periksa` (`id_daftar_poli`, `tanggal_periksa`, `catatan`, `biaya_periksa`) VALUES ('15', '2024-12-29', 'Hasil USG perkembangnya baik dan bagus', 211000)
INSERT INTO `detail_periksa` (`id_periksa`, `id_obat`) VALUES (6, '3')

public function editPeriksa($idPeriksa)
{
    $periksa = $this->periksaModel
        ->select('periksa.*, daftar_poli.keluhan, pasien.nama AS nama_pasien, poli.nama_poli')
        ->join('daftar_poli', 'daftar_poli.id = periksa.id_daftar_poli', 'left')
        ->join('pasien', 'pasien.id = daftar_poli.id_pasien', 'left')
        ->join('poli', 'poli.id = daftar_poli.id_poli', 'left')
        ->where('periksa.id', $idPeriksa)
        ->first();

    if (!$periksa) {
        return redirect()->to('/dokter/periksa')->with('error', 'Data pemeriksaan tidak ditemukan.');
    }

    $obat = $this->obatModel->findAll();

    $data = [
        'title' => 'Edit Pemeriksaan',
        'periksa' => $periksa,
        'obat' => $obat,
        'selectedObat' => $this->detailPeriksaModel->where('id_periksa', $idPeriksa)->findAll(),
---
SELECT `periksa`.*, `daftar_poli`.`keluhan`, `pasien`.`nama` AS `nama_pasien`, `poli`.`nama_poli`
FROM `periksa`
LEFT JOIN `daftar_poli` ON `daftar_poli`.`id` = `periksa`.`id_daftar_poli`
LEFT JOIN `pasien` ON `pasien`.`id` = `daftar_poli`.`id_pasien`
LEFT JOIN `poli` ON `poli`.`id` = `daftar_poli`.`id_poli`
WHERE `periksa`.`id` = '4'
 LIMIT 1
SELECT *
FROM `obat`
SELECT *
FROM `detail_periksa`
WHERE `id_periksa` = '4'

    public function riwayatPasien()
    {
        $idDokter = session()->get('userId');

        $riwayatPasien = $this->daftarPoliModel
            ->select('pasien.id as id_pasien, pasien.no_rm, pasien.no_ktp, pasien.nama, pasien.no_hp, pasien.alamat')
            ->join('pasien', 'pasien.id = daftar_poli.id_pasien', 'left')
            ->join('jadwal_periksa', 'jadwal_periksa.id = daftar_poli.id_jadwal', 'left')
            ->where('jadwal_periksa.id_dokter', $idDokter)
            ->groupBy('pasien.id')
            ->paginate(10); // Pastikan paginate() digunakan di sini
---
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `pasien`.`id` as `id_pasien`, `pasien`.`no_rm`, `pasien`.`no_ktp`, `pasien`.`nama`, `pasien`.`no_hp`, `pasien`.`alamat`
FROM `daftar_poli`
LEFT JOIN `pasien` ON `pasien`.`id` = `daftar_poli`.`id_pasien`
LEFT JOIN `jadwal_periksa` ON `jadwal_periksa`.`id` = `daftar_poli`.`id_jadwal`
WHERE `jadwal_periksa`.`id_dokter` = '1'
GROUP BY `pasien`.`id`
) CI_count_all_results
SELECT `pasien`.`id` as `id_pasien`, `pasien`.`no_rm`, `pasien`.`no_ktp`, `pasien`.`nama`, `pasien`.`no_hp`, `pasien`.`alamat`
FROM `daftar_poli`
LEFT JOIN `pasien` ON `pasien`.`id` = `daftar_poli`.`id_pasien`
LEFT JOIN `jadwal_periksa` ON `jadwal_periksa`.`id` = `daftar_poli`.`id_jadwal`
WHERE `jadwal_periksa`.`id_dokter` = '1'
GROUP BY `pasien`.`id`
 LIMIT 10