app/Controllers/Home.php

SELECT *
FROM `dokter`
WHERE `nama` = 'Dr. Andi Rahmat'
AND `alamat` = 'Jl. Merdeka No. 10'
 LIMIT 1
---
    public function loginDoctor()
    {
        $username = $this->request->getPost('nama');
        $password = $this->request->getPost('alamat');

        // Cari data dokter berdasarkan nama dan alamat
        $dokter = $this->dokterModel->where('nama', $username)->where('alamat', $password)->first();

SELECT *
FROM `pasien`
WHERE `nama` = 'Fendya Gusti Pramudya'
AND `alamat` = 'Semarang'
 LIMIT 1
---
    public function loginPatient()
    {
        $username = $this->request->getPost('nama');
        $password = $this->request->getPost('alamat');

        $pasien = $this->pasienModel->where('nama', $username)->where('alamat', $password)->first();

SELECT `daftar_poli`.*, `poli`.`nama_poli`, `dokter`.`nama` AS `nama_dokter`, `jadwal_periksa`.`hari`, `jadwal_periksa`.`jam_mulai`, `jadwal_periksa`.`jam_selesai`, `pasien`.`nama` AS `nama_pasien`, `periksa`.`tanggal_periksa`, CASE 
                    WHEN periksa.id IS NOT NULL THEN 'Sudah Diperiksa' 
                    ELSE 'Belum Diperiksa' 
                END AS status_periksa
FROM `daftar_poli`
LEFT JOIN `poli` ON `poli`.`id` = `daftar_poli`.`id_poli`
LEFT JOIN `jadwal_periksa` ON `jadwal_periksa`.`id` = `daftar_poli`.`id_jadwal`
LEFT JOIN `dokter` ON `dokter`.`id` = `jadwal_periksa`.`id_dokter`
LEFT JOIN `pasien` ON `pasien`.`id` = `daftar_poli`.`id_pasien`
LEFT JOIN `periksa` ON `periksa`.`id_daftar_poli` = `daftar_poli`.`id`
WHERE `daftar_poli`.`id_pasien` = '1'
ORDER BY `daftar_poli`.`created_at` DESC
 LIMIT 1
---
    public function dashboardPasien()
    {
        if (!session()->get('isLoggedIn') || session()->get('userType') !== 'pasien') {
            echo "<script>alert('Anda harus login sebagai pasien.'); window.location.href='/';</script>";
        }

        $idPasien = session()->get('userId'); // Ambil ID pasien dari sesi
        if (!$idPasien) {
            echo "<script>alert('Session tidak valid, silakan login ulang.'); window.location.href='/';</script>";
        }

        // Ambil data daftar poli terakhir
        $daftarPoliModel = new \App\Models\DaftarPoliModel();
        $daftarPoliTerakhir = $daftarPoliModel
            ->select("
                daftar_poli.*,
                poli.nama_poli,
                dokter.nama AS nama_dokter,
                jadwal_periksa.hari,
                jadwal_periksa.jam_mulai,
                jadwal_periksa.jam_selesai,
                pasien.nama AS nama_pasien,
                periksa.tanggal_periksa,
                CASE
                    WHEN periksa.id IS NOT NULL THEN 'Sudah Diperiksa'
                    ELSE 'Belum Diperiksa'
                END AS status_periksa
            ")
            ->join('poli', 'poli.id = daftar_poli.id_poli', 'left')
            ->join('jadwal_periksa', 'jadwal_periksa.id = daftar_poli.id_jadwal', 'left')
            ->join('dokter', 'dokter.id = jadwal_periksa.id_dokter', 'left')
            ->join('pasien', 'pasien.id = daftar_poli.id_pasien', 'left') // Tambahkan join ke tabel pasien
            ->join('periksa', 'periksa.id_daftar_poli = daftar_poli.id', 'left') // Tambahkan join ke tabel periksa
            ->where('daftar_poli.id_pasien', $idPasien)
            ->orderBy('daftar_poli.created_at', 'DESC')
            ->first();