app/Controllers/ObatController.php

SELECT *
FROM `obat`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `obat`
---
    public function index()
    {
        $obatModel = new \App\Models\ObatModel();
        $data = [
            'breadcrumb' => ['Kelola Obat'],
            'breadcrumbLinks' => ['/obat'],
            'title' => 'Kelola Obat',
            'obat' => $obatModel->paginate(10),

INSERT INTO `obat` (`nama_obat`, `kemasan`, `harga`) VALUES ('Omeprazole 20mg', '10 Strip x 10 Tablet', '30000')
---
    public function store()
    {
        $this->validate([
            'nama_obat' => 'required',
            'kemasan' => 'required',
            'harga' => 'required|decimal'
        ]);

        $this->obatModel->save([
            'nama_obat' => $this->request->getPost('nama_obat'),
            'kemasan' => $this->request->getPost('kemasan'),
            'harga' => $this->request->getPost('harga'),
        ]);