app/Controllers/PasienController.php

      public function daftarPoli()
      {
          $idPasien = session()->get('userId'); // Ambil ID pasien dari sesi

          $daftarPoli = $this->daftarPoliModel
              ->select('daftar_poli.*, jadwal_periksa.hari, jadwal_periksa.jam_mulai, jadwal_periksa.jam_selesai, dokter.nama AS nama_dokter, poli.nama_poli')
              ->join('jadwal_periksa', 'jadwal_periksa.id = daftar_poli.id_jadwal', 'left')
              ->join('dokter', 'dokter.id = jadwal_periksa.id_dokter', 'left') // Ambil dokter dari jadwal_periksa
              ->join('poli', 'poli.id = daftar_poli.id_poli', 'left') // Ambil poli langsung
              ->where('daftar_poli.id_pasien', $idPasien)
              ->paginate(10);
---
SELECT COUNT(*) AS `numrows`
FROM `daftar_poli`
LEFT JOIN `jadwal_periksa` ON `jadwal_periksa`.`id` = `daftar_poli`.`id_jadwal`
LEFT JOIN `dokter` ON `dokter`.`id` = `jadwal_periksa`.`id_dokter`
LEFT JOIN `poli` ON `poli`.`id` = `daftar_poli`.`id_poli`
WHERE `daftar_poli`.`id_pasien` = '1'
SELECT `daftar_poli`.*, `jadwal_periksa`.`hari`, `jadwal_periksa`.`jam_mulai`, `jadwal_periksa`.`jam_selesai`, `dokter`.`nama` AS `nama_dokter`, `poli`.`nama_poli`
FROM `daftar_poli`
LEFT JOIN `jadwal_periksa` ON `jadwal_periksa`.`id` = `daftar_poli`.`id_jadwal`
LEFT JOIN `dokter` ON `dokter`.`id` = `jadwal_periksa`.`id_dokter`
LEFT JOIN `poli` ON `poli`.`id` = `daftar_poli`.`id_poli`
WHERE `daftar_poli`.`id_pasien` = '1'
 LIMIT 10

      public function getJadwalByPoli($idPoli)
      {
          $builder = $this->jadwalModel
              ->select('jadwal_periksa.id, jadwal_periksa.hari, jadwal_periksa.jam_mulai, jadwal_periksa.jam_selesai, dokter.nama as nama_dokter, poli.nama_poli')
              ->join('dokter', 'dokter.id = jadwal_periksa.id_dokter', 'left')
              ->join('poli', 'poli.id = dokter.id_poli', 'left')
              ->where('poli.id', $idPoli) // Filter berdasarkan ID poli
              ->where('jadwal_periksa.status', 'aktif');

          $jadwal = $builder->findAll();
---
SELECT `jadwal_periksa`.`id`, `jadwal_periksa`.`hari`, `jadwal_periksa`.`jam_mulai`, `jadwal_periksa`.`jam_selesai`, `dokter`.`nama` as `nama_dokter`, `poli`.`nama_poli`
FROM `jadwal_periksa`
LEFT JOIN `dokter` ON `dokter`.`id` = `jadwal_periksa`.`id_dokter`
LEFT JOIN `poli` ON `poli`.`id` = `dokter`.`id_poli`
WHERE `poli`.`id` = '4'
AND `jadwal_periksa`.`status` = 'aktif'

    public function createDaftarPoli()
    {
        // Ambil ID pasien dari session
        $idPasien = session()->get('userId');

        // Validasi apakah pasien sudah login
        if (!$idPasien) {
            return redirect()->to('/')->with('error', 'Session tidak valid, silakan login ulang.');
        }

        // Ambil data pasien berdasarkan ID
        $pasien = $this->pasienModel->select('id, no_rm, nama')->where('id', $idPasien)->first();

        // Validasi jika data pasien tidak ditemukan
        if (!$pasien) {
            return redirect()->to('/')->with('error', 'Data pasien tidak ditemukan.');
        }

        // Ambil semua data poli
        $poli = $this->poliModel->findAll();

        // Ambil jadwal dokter yang aktif (ini hanya data awal, akan disaring via AJAX di frontend)
        $jadwal = $this->jadwalModel
            ->select('jadwal_periksa.*, dokter.nama as nama_dokter')
            ->join('dokter', 'dokter.id = jadwal_periksa.id_dokter', 'left')
            ->where('jadwal_periksa.status', 'aktif') // Hanya jadwal aktif
            ->findAll();
---
SELECT `id`, `no_rm`, `nama`
FROM `pasien`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `poli`
SELECT `jadwal_periksa`.*, `dokter`.`nama` as `nama_dokter`
FROM `jadwal_periksa`
LEFT JOIN `dokter` ON `dokter`.`id` = `jadwal_periksa`.`id_dokter`
WHERE `jadwal_periksa`.`status` = 'aktif'

    public function storeDaftarPoli()
    {
        $idPasien = session()->get('userId');

        // Validasi input
        $this->validate([
            'id_poli' => 'required',
            'id_jadwal' => 'required',
            'keluhan' => 'required',
        ], [
            'id_poli.required' => 'Poli wajib dipilih.',
            'id_jadwal.required' => 'Jadwal wajib dipilih.',
            'keluhan.required' => 'Keluhan wajib diisi.',
        ]);

        // Ambil data jadwal
        $jadwal = $this->jadwalModel->find($this->request->getPost('id_jadwal'));

        if (!$jadwal) {
            return redirect()->back()->withInput()->with('error', 'Jadwal tidak ditemukan.');
        }

        try {
            // Generate nomor antrian baru
            $lastAntrian = $this->daftarPoliModel
                ->where('id_jadwal', $this->request->getPost('id_jadwal'))
                ->orderBy('no_antrian', 'DESC')
                ->first();
---
SELECT *
FROM `daftar_poli`
WHERE `id_jadwal` = '7'
ORDER BY `no_antrian` DESC
 LIMIT 1

            $noAntrian = $lastAntrian ? $lastAntrian['no_antrian'] + 1 : 1;

            // Simpan data pendaftaran
            $this->daftarPoliModel->insert([
                'id_pasien' => $idPasien,
                'id_poli' => $this->request->getPost('id_poli'),
                'id_jadwal' => $this->request->getPost('id_jadwal'),
                'keluhan' => $this->request->getPost('keluhan'),
                'no_antrian' => $noAntrian,
            ]);
---
INSERT INTO `daftar_poli` (`id_pasien`, `id_poli`, `id_jadwal`, `keluhan`, `no_antrian`) VALUES ('1', '4', '7', 'Test', 1)

      public function detailPeriksa($idDaftarPoli)
      {
          $idPasien = session()->get('userId');

          // Ambil data pendaftaran poli
          $daftarPoli = $this->daftarPoliModel
              ->select('daftar_poli.*, jadwal_periksa.hari, jadwal_periksa.jam_mulai, jadwal_periksa.jam_selesai, poli.nama_poli, dokter.nama AS nama_dokter')
              ->join('jadwal_periksa', 'jadwal_periksa.id = daftar_poli.id_jadwal', 'left')
              ->join('dokter', 'dokter.id = jadwal_periksa.id_dokter', 'left')
              ->join('poli', 'poli.id = daftar_poli.id_poli', 'left')
              ->where('daftar_poli.id', $idDaftarPoli)
              ->where('daftar_poli.id_pasien', $idPasien)
              ->first();

          if (!$daftarPoli) {
              return redirect()->to('/pasien/daftar-poli')->with('error', 'Data tidak ditemukan.');
          }

          // Ambil data pemeriksaan
          $periksa = $this->periksaModel
              ->where('id_daftar_poli', $idDaftarPoli)
              ->first();
---
SELECT `daftar_poli`.*, `jadwal_periksa`.`hari`, `jadwal_periksa`.`jam_mulai`, `jadwal_periksa`.`jam_selesai`, `poli`.`nama_poli`, `dokter`.`nama` AS `nama_dokter`
FROM `daftar_poli`
LEFT JOIN `jadwal_periksa` ON `jadwal_periksa`.`id` = `daftar_poli`.`id_jadwal`
LEFT JOIN `dokter` ON `dokter`.`id` = `jadwal_periksa`.`id_dokter`
LEFT JOIN `poli` ON `poli`.`id` = `daftar_poli`.`id_poli`
WHERE `daftar_poli`.`id` = '15'
AND `daftar_poli`.`id_pasien` = '1'
 LIMIT 1
SELECT `daftar_poli`.*, `jadwal_periksa`.`hari`, `jadwal_periksa`.`jam_mulai`, `jadwal_periksa`.`jam_selesai`, `poli`.`nama_poli`, `dokter`.`nama` AS `nama_dokter`
FROM `daftar_poli`
LEFT JOIN `jadwal_periksa` ON `jadwal_periksa`.`id` = `daftar_poli`.`id_jadwal`
LEFT JOIN `dokter` ON `dokter`.`id` = `jadwal_periksa`.`id_dokter`
LEFT JOIN `poli` ON `poli`.`id` = `daftar_poli`.`id_poli`
WHERE `daftar_poli`.`id` = '13'
AND `daftar_poli`.`id_pasien` = '1'
 LIMIT 1
SELECT *
FROM `periksa`
WHERE `id_daftar_poli` = '15'
 LIMIT 1