app/Models/DetailPeriksaModel.php

SELECT `detail_periksa`.*, `obat`.`nama_obat`, `obat`.`kemasan`, `obat`.`harga`
FROM `detail_periksa`
LEFT JOIN `obat` ON `obat`.`id` = `detail_periksa`.`id_obat`
WHERE `detail_periksa`.`id_periksa` = '3'
---
    public function getDetailByPeriksa($idPeriksa)
    {
        return $this->select('detail_periksa.*, obat.nama_obat, obat.kemasan, obat.harga')
            ->join('obat', 'obat.id = detail_periksa.id_obat', 'left')
            ->where('detail_periksa.id_periksa', $idPeriksa)
            ->findAll();