app/Models/PasienModel.php

    public function paginatePasien($perPage = 10)
    {
        return $this->paginate($perPage);
---
SELECT *
FROM `pasien`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `pasien`