app/Models/PoliModel.php

    public function paginatePoli($perPage = 10)
    {
        return $this->paginate($perPage);
---
SELECT *
FROM `poli`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `poli`